app/views/users/index.html.erb

<script type="text/javascript">
  jQuery(document).ready(function() {
  	  var h6_tags = $(".user-list > li").find('h6');
	  setTimeout(function() {
	    var source = new EventSource('/status');

	    source.addEventListener('presence', function(e) {
	      console.log("presence");
	      var arr = e.data.replace(/[\[\]'"]+/g,'').split(",");
	      if (arr[1] == "join"){
	      	for(var i=0; i<h6_tags.length; i++){
		  	  if(h6_tags.eq(i).html() == arr[0]) {
		  		h6_tags.eq(i).next().html('Online');
		  	  }
		    }
	      }
	      if (arr[1] == "leave"){
	      	console.log("left");
	      	for(var i=0; i<h6_tags.length; i++){
		  	  if(h6_tags.eq(i).html() == arr[0]) {
		  		h6_tags.eq(i).next().html('Offline');
		  	  }
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1