app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def status_monitor
    render :json => User.all